{
  "backend/main.mo": "Motoko actor storing reservations in a map with creation and lookup functions.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of frontend components, sections, hooks, and assets.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode values, and global styling.",
  "frontend/index.html": "Main HTML entry file with SEO metadata and root mount point for the React app.",
  "frontend/src/App.tsx": "Top-level React component composing all site sections, navbar, footer, and toaster notifications.",
  "frontend/src/components/booking/ReservationForm.tsx": "Reservation form component with validation, loading states, and submission to backend via hook.",
  "frontend/src/components/contact/MapEmbed.tsx": "OpenStreetMap iframe embed with styled container and fallback message.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Modal lightbox supporting navigation, keyboard controls, and image display.",
  "frontend/src/components/layout/Footer.tsx": "Footer with restaurant info, navigation links, social icons, and attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navbar with scroll-based styling and desktop/mobile navigation that triggers smooth scrolling to sections.",
  "frontend/src/components/menu/MenuCard.tsx": "Displays a menu item card with hover animations, category, description, price, and optional featured badge.",
  "frontend/src/components/three/FoodHeroScene.tsx": "Three.js scene rendering animated warm-lit 3D shapes representing food-themed elements with reduced-motion support.",
  "frontend/src/components/three/useReducedMotion.ts": "Hook that tracks the user's prefers-reduced-motion setting via a media query.",
  "frontend/src/data/gallery.ts": "Exports gallery image metadata including paths, alt text, and captions.",
  "frontend/src/data/menu.ts": "Defines menu item types and a list of dishes with descriptions, prices, categories, and featured flags.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCreateReservation.ts": "Hook that calls the backend to create reservations with loading state, deduping, and user-friendly error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks to manage Internet Identity login, stored identity loading, and authentication state.",
  "frontend/src/index.css": "Tailwind-based global styles defining CSS variables, dark theme, typography, and utility layers.",
  "frontend/src/lib/scrollToSection.ts": "Smooth-scroll helper that offsets scroll position based on the fixed navbar height.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/sections/BookingSection.tsx": "Renders the booking section with a header and embeds the ReservationForm component.",
  "frontend/src/sections/ContactSection.tsx": "Displays contact information and a map embed, including address, phone, and hours.",
  "frontend/src/sections/GallerySection.tsx": "Shows a grid of gallery images with captions and opens a lightbox when an image is selected.",
  "frontend/src/sections/HeroSection.tsx": "Provides the hero section with background image, 3D canvas scene, and navigation buttons.",
  "frontend/src/sections/MenuSection.tsx": "Displays a menu section that lists menu items using MenuCard components.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Stores project metadata, requirements, features, and pending feature requests for the production deployment."
}